jmh-examples-java-servlet-filter/results/results-ab-with-filters.txt
ab -e results/results-ab-with-filters.csv -l -n 100 -c 10 -k -H "Accept-Encoding: gzip, deflate" http://127.0.0.1:9090/jmh-examples-java-servlet-filter
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            9090

Document Path:          /jmh-examples-java-servlet-filter
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   0.277 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    100
Total transferred:      51332 bytes
HTML transferred:       37332 bytes
Requests per second:    361.37 [#/sec] (mean)
Time per request:       27.672 [ms] (mean)
Time per request:       2.767 [ms] (mean, across all concurrent requests)
Transfer rate:          181.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1   27  58.0      7     212
Waiting:        1   27  58.0      7     212
Total:          1   27  58.1      7     212

Percentage of the requests served within a certain time (ms)
  50%      7
  66%     10
  75%     13
  80%     15
  90%    192
  95%    199
  98%    212
  99%    212
 100%    212 (longest request)