jmh-examples-java-servlet-filter/results/results-ab-without-filters.txt
ab -e results/results-ab-without-filters.csv -l -n 100 -c 10 -k -H "Accept-Encoding: gzip, deflate" http://127.0.0.1:9090/jmh-examples-java-servlet-filter
This is ApacheBench, Version 2.3 <$Revision: 1796539 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            9090

Document Path:          /jmh-examples-java-servlet-filter
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   0.214 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    100
Total transferred:      51325 bytes
HTML transferred:       37325 bytes
Requests per second:    466.66 [#/sec] (mean)
Time per request:       21.429 [ms] (mean)
Time per request:       2.143 [ms] (mean, across all concurrent requests)
Transfer rate:          233.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:     1   21  53.8      2     185
Waiting:        1   21  53.8      2     185
Total:          1   21  54.0      2     185

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      4
  80%      6
  90%    178
  95%    181
  98%    185
  99%    185
 100%    185 (longest request)